## Pandas

* Pandas is used to analyse data & big data, and make conclusion based on stastistical theories

* Pandas is typically used to clean messy data & make them readable & simple to access.

* It can also help in finding the relationship between coloumns (co-relation)

* It can also be used in doing all statistical methodologies as well as plotting & creating graphs

* It can handle multiple type pf data structures (Excel,CSV,Json,RDBMS,html,pdf etc.. )

In [1]:
pip install pandas

Requirement already satisfied: pandas in c:\users\admin\appdata\local\programs\python\python39\lib\site-packages (1.4.3)
Requirement already satisfied: numpy>=1.18.5 in c:\users\admin\appdata\local\programs\python\python39\lib\site-packages (from pandas) (1.23.1)
Requirement already satisfied: pytz>=2020.1 in c:\users\admin\appdata\local\programs\python\python39\lib\site-packages (from pandas) (2022.1)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\admin\appdata\local\programs\python\python39\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: six>=1.5 in c:\users\admin\appdata\local\programs\python\python39\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

WARNING: You are using pip version 22.0.4; however, version 22.3.1 is available.
You should consider upgrading via the 'C:\Users\admin\AppData\Local\Programs\Python\Python39\python.exe -m pip install --upgrade pip' command.

In [2]:
import pandas as pd

In [3]:
pd.__version__

'1.4.3'

## Series

* A series is a **1-Dimensional Array like object** containing a sequence of values (of similar data types) and an associated array of data labels called as **indexes**

In [4]:
ser1 = pd.Series([10,20,30,40,50])

In [5]:
ser1

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [6]:
import numpy as np
arr = np.array([100,200,300,400])

In [7]:
arr

array([100, 200, 300, 400])

## defining the indexes

In [8]:
ser2 = pd.Series([100,200,300,400,500],index=['d','b','a','c','e'])

In [9]:
ser2

d    100
b    200
a    300
c    400
e    500
dtype: int64

In [10]:
ser2['a']

300

In [11]:
ser2[2]

300

In [12]:
ser3 = pd.Series([100,200,300],index=['1','2','3'])

In [13]:
ser3

1    100
2    200
3    300
dtype: int64

In [14]:
ser3[2]

300

In [15]:
ser2

d    100
b    200
a    300
c    400
e    500
dtype: int64

In [16]:
ser2.index

Index(['d', 'b', 'a', 'c', 'e'], dtype='object')

In [17]:
ser1

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [18]:
ser1.index

RangeIndex(start=0, stop=5, step=1)

In [19]:
ser1

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [20]:
ser1[1:3]

1    20
2    30
dtype: int64

In [21]:
ser2

d    100
b    200
a    300
c    400
e    500
dtype: int64

In [22]:
ser2['d':'a']

d    100
b    200
a    300
dtype: int64

In [23]:
ser3

1    100
2    200
3    300
dtype: int64

In [24]:
ser3[0:2]

1    100
2    200
dtype: int64

In [25]:
ser3[0:2]

1    100
2    200
dtype: int64

In [26]:
ser3['1':'3']

1    100
2    200
3    300
dtype: int64

In [27]:
ser3

1    100
2    200
3    300
dtype: int64

In [28]:
ser3.index

Index(['1', '2', '3'], dtype='object')

In [29]:
ser3['1':'2']

1    100
2    200
dtype: int64

In [30]:
ser3[0:3]

1    100
2    200
3    300
dtype: int64

In [31]:
ser3[0:2]

1    100
2    200
dtype: int64

In [32]:
ser3[1:2]

2    200
dtype: int64

In [33]:
ser2

d    100
b    200
a    300
c    400
e    500
dtype: int64

In [34]:
ser1

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [35]:
ser1[0]

10

In [36]:
ser1[[0,3,4]]

0    10
3    40
4    50
dtype: int64

In [37]:
ser2

d    100
b    200
a    300
c    400
e    500
dtype: int64

In [38]:
ser2[['b','c','e']]

b    200
c    400
e    500
dtype: int64

In [39]:
ser1

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [40]:
ser1 > 20

0    False
1    False
2     True
3     True
4     True
dtype: bool

In [41]:
ser1[ser1>20]

2    30
3    40
4    50
dtype: int64

In [42]:
type(ser1)

pandas.core.series.Series

In [43]:
ser1

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [44]:
ser1+50

0     60
1     70
2     80
3     90
4    100
dtype: int64

In [45]:
ser1

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [46]:
ser1 * 50

0     500
1    1000
2    1500
3    2000
4    2500
dtype: int64

In [47]:
ser1/50

0    0.2
1    0.4
2    0.6
3    0.8
4    1.0
dtype: float64

In [48]:
ser1//50

0    0
1    0
2    0
3    0
4    1
dtype: int64

In [49]:
ser1 ** 2

0     100
1     400
2     900
3    1600
4    2500
dtype: int64

In [50]:
ser1[1:3]*30

1    600
2    900
dtype: int64

In [51]:
data = {
    'Mumbai':1700,
    'Delhi':3000,
    'Nagpur':5000,
    'Chennai':['hello','hi','bye']
}

In [52]:
data

{'Mumbai': 1700,
 'Delhi': 3000,
 'Nagpur': 5000,
 'Chennai': ['hello', 'hi', 'bye']}

In [53]:
ser5 = pd.Series(data)

In [54]:
ser5

Mumbai                 1700
Delhi                  3000
Nagpur                 5000
Chennai    [hello, hi, bye]
dtype: object

In [55]:
ser5.index

Index(['Mumbai', 'Delhi', 'Nagpur', 'Chennai'], dtype='object')

In [56]:
ser5['Mumbai']

1700

In [57]:
ser5[0]

1700

In [58]:
data

{'Mumbai': 1700,
 'Delhi': 3000,
 'Nagpur': 5000,
 'Chennai': ['hello', 'hi', 'bye']}

In [59]:
ser8 = pd.Series(data)

In [60]:
ser8

Mumbai                 1700
Delhi                  3000
Nagpur                 5000
Chennai    [hello, hi, bye]
dtype: object

In [61]:
ser8['Chennai'][0:2]

['hello', 'hi']

In [62]:
data = {
    'Mumbai':1700,
    'Delhi':3000,
    'Nagpur':5000,
    'Chennai':3212
}

In [63]:
data

{'Mumbai': 1700, 'Delhi': 3000, 'Nagpur': 5000, 'Chennai': 3212}

In [64]:
city = ['Mumbai','Delhi','Nagpur','Chennai','Ahemdabad']

In [65]:
ser1 = pd.Series(data,index=city)

In [66]:
ser1

Mumbai       1700.0
Delhi        3000.0
Nagpur       5000.0
Chennai      3212.0
Ahemdabad       NaN
dtype: float64

In [67]:
pd.notnull(ser1)

Mumbai        True
Delhi         True
Nagpur        True
Chennai       True
Ahemdabad    False
dtype: bool

In [68]:
pd.isnull(ser1)

Mumbai       False
Delhi        False
Nagpur       False
Chennai      False
Ahemdabad     True
dtype: bool

In [69]:
ser1

Mumbai       1700.0
Delhi        3000.0
Nagpur       5000.0
Chennai      3212.0
Ahemdabad       NaN
dtype: float64

In [70]:
ser1[pd.notnull(ser1)]

Mumbai     1700.0
Delhi      3000.0
Nagpur     5000.0
Chennai    3212.0
dtype: float64

In [71]:
s1 = pd.Series(10,index=['test'])

In [72]:
s1

test    10
dtype: int64

In [73]:
s2 = pd.Series(20,index=['Test'])

In [74]:
s2

Test    20
dtype: int64

In [75]:
s1+s2

Test   NaN
test   NaN
dtype: float64

**Data Frame**


* A dataframe represents a rectangular table of data & consists ordered collections of columns which can be of different data-types

* The DataFrame has both rows & columns index, it can be thought as a dictionary of series, all sharing same indexes

* The data is stored in **one or more 2-D block**

<img src="https://media.geeksforgeeks.org/wp-content/uploads/finallpandas.png" width="550" height="450">

In [76]:
data1 = {
    'State' : ['Mumbai','Pune','Chennai','Delhi','Nagpur'],
    'year' : [2001,2011,2018,2019,2020],
    'population':[1.5,1.7,3.6,6.2,3.2]
}

In [77]:
data1

{'State': ['Mumbai', 'Pune', 'Chennai', 'Delhi', 'Nagpur'],
 'year': [2001, 2011, 2018, 2019, 2020],
 'population': [1.5, 1.7, 3.6, 6.2, 3.2]}

In [78]:
pd.Series(data1)

State         [Mumbai, Pune, Chennai, Delhi, Nagpur]
year                  [2001, 2011, 2018, 2019, 2020]
population                 [1.5, 1.7, 3.6, 6.2, 3.2]
dtype: object

In [79]:
df = pd.DataFrame(data1)

In [80]:
df

     State  year  population
0   Mumbai  2001         1.5
1     Pune  2011         1.7
2  Chennai  2018         3.6
3    Delhi  2019         6.2
4   Nagpur  2020         3.2

In [81]:
df.head(3)  #if you are not providing any argument then the default value is 5

     State  year  population
0   Mumbai  2001         1.5
1     Pune  2011         1.7
2  Chennai  2018         3.6

In [82]:
df.tail(2) #it will show you the data from below, and the default value is 5

    State  year  population
3   Delhi  2019         6.2
4  Nagpur  2020         3.2

In [83]:
df

     State  year  population
0   Mumbai  2001         1.5
1     Pune  2011         1.7
2  Chennai  2018         3.6
3    Delhi  2019         6.2
4   Nagpur  2020         3.2

In [84]:
df2 = pd.DataFrame(data1,index=['one','two','three','four','five'],columns=['State','year','population','debt'])

In [85]:
df2

         State  year  population debt
one     Mumbai  2001         1.5  NaN
two       Pune  2011         1.7  NaN
three  Chennai  2018         3.6  NaN
four     Delhi  2019         6.2  NaN
five    Nagpur  2020         3.2  NaN

In [86]:
df2.columns

Index(['State', 'year', 'population', 'debt'], dtype='object')

In [87]:
df2.columns = ['STATE','YEAR','POPULATION','DEBT']

In [88]:
df2

         STATE  YEAR  POPULATION DEBT
one     Mumbai  2001         1.5  NaN
two       Pune  2011         1.7  NaN
three  Chennai  2018         3.6  NaN
four     Delhi  2019         6.2  NaN
five    Nagpur  2020         3.2  NaN

In [89]:
df2['STATE']

one       Mumbai
two         Pune
three    Chennai
four       Delhi
five      Nagpur
Name: STATE, dtype: object

In [90]:
df2[['STATE','POPULATION']]  #fetching multiple columns

         STATE  POPULATION
one     Mumbai         1.5
two       Pune         1.7
three  Chennai         3.6
four     Delhi         6.2
five    Nagpur         3.2

In [91]:
df2['DEBT']

one      NaN
two      NaN
three    NaN
four     NaN
five     NaN
Name: DEBT, dtype: object

In [92]:
df2['DEBT'] = 0

In [93]:
df2

         STATE  YEAR  POPULATION  DEBT
one     Mumbai  2001         1.5     0
two       Pune  2011         1.7     0
three  Chennai  2018         3.6     0
four     Delhi  2019         6.2     0
five    Nagpur  2020         3.2     0

In [94]:
df2['DEBT'] = np.arange(1,6)

In [95]:
df2

         STATE  YEAR  POPULATION  DEBT
one     Mumbai  2001         1.5     1
two       Pune  2011         1.7     2
three  Chennai  2018         3.6     3
four     Delhi  2019         6.2     4
five    Nagpur  2020         3.2     5

In [96]:
df2.loc['three']

STATE         Chennai
YEAR             2018
POPULATION        3.6
DEBT                3
Name: three, dtype: object

In [97]:
df2.iloc[2]

STATE         Chennai
YEAR             2018
POPULATION        3.6
DEBT                3
Name: three, dtype: object

In [98]:

df2.loc[['one','four']]  ## fetching multiple rows.

       STATE  YEAR  POPULATION  DEBT
one   Mumbai  2001         1.5     1
four   Delhi  2019         6.2     4

In [99]:
df2.iloc[[0,2,4]]

         STATE  YEAR  POPULATION  DEBT
one     Mumbai  2001         1.5     1
three  Chennai  2018         3.6     3
five    Nagpur  2020         3.2     5

In [100]:
df2.iloc[2]

STATE         Chennai
YEAR             2018
POPULATION        3.6
DEBT                3
Name: three, dtype: object

In [101]:
df2

         STATE  YEAR  POPULATION  DEBT
one     Mumbai  2001         1.5     1
two       Pune  2011         1.7     2
three  Chennai  2018         3.6     3
four     Delhi  2019         6.2     4
five    Nagpur  2020         3.2     5

In [102]:
df2

         STATE  YEAR  POPULATION  DEBT
one     Mumbai  2001         1.5     1
two       Pune  2011         1.7     2
three  Chennai  2018         3.6     3
four     Delhi  2019         6.2     4
five    Nagpur  2020         3.2     5

In [103]:
df2

         STATE  YEAR  POPULATION  DEBT
one     Mumbai  2001         1.5     1
two       Pune  2011         1.7     2
three  Chennai  2018         3.6     3
four     Delhi  2019         6.2     4
five    Nagpur  2020         3.2     5

In [104]:
# df2['year']['two'] = 2022

In [105]:
df2

         STATE  YEAR  POPULATION  DEBT
one     Mumbai  2001         1.5     1
two       Pune  2011         1.7     2
three  Chennai  2018         3.6     3
four     Delhi  2019         6.2     4
five    Nagpur  2020         3.2     5

In [106]:
# df2['year']['five']

## index objects

In [107]:
obj = pd.Series(range(3),index=['a','b','c'])

In [108]:
obj
obj.index

Index(['a', 'b', 'c'], dtype='object')

In [109]:
my_index = obj.index

In [110]:
my_index

Index(['a', 'b', 'c'], dtype='object')

In [111]:
my_index[0]

'a'

In [112]:
# my_index[0] = 'x'

In [113]:
obj2 = pd.Series([4.1,7.5,-8.3,3.6],index=['d','a','b','c'])

In [114]:
obj2

d    4.1
a    7.5
b   -8.3
c    3.6
dtype: float64

In [115]:
res = obj2.reindex(['a','b','c','d'])

In [116]:
res

a    7.5
b   -8.3
c    3.6
d    4.1
dtype: float64

In [117]:
obj2

d    4.1
a    7.5
b   -8.3
c    3.6
dtype: float64

In [118]:
obj2.reindex(['a','b','c','d'])

a    7.5
b   -8.3
c    3.6
d    4.1
dtype: float64

In [119]:
obj3 = pd.Series(['blue','purple','red'],index=[0,2,4])

In [120]:
obj3

0      blue
2    purple
4       red
dtype: object

In [121]:
res1 = obj3.reindex(range(7),method='ffill')

In [122]:
res1

0      blue
1      blue
2    purple
3    purple
4       red
5       red
6       red
dtype: object

In [123]:
obj3

0      blue
2    purple
4       red
dtype: object

In [124]:
obj3.reindex(range(6),method='bfill')

0      blue
1    purple
2    purple
3       red
4       red
5       NaN
dtype: object

## dropping entries in series

In [125]:
obj4 = pd.Series(np.arange(5),index=['a','b','c','d','e'])

In [126]:
obj4

a    0
b    1
c    2
d    3
e    4
dtype: int32

In [127]:
obj4.drop('c')

a    0
b    1
d    3
e    4
dtype: int32

In [128]:
obj4

a    0
b    1
c    2
d    3
e    4
dtype: int32

In [129]:
obj4.drop(['a','d','e'])

b    1
c    2
dtype: int32

In [130]:
df3 = pd.DataFrame(np.arange(16).reshape(4,4),
                  index=['Mumbai','Pune','Chennai','Delhi'],
                  columns=['one','two','three','four'])

In [131]:
df3

         one  two  three  four
Mumbai     0    1      2     3
Pune       4    5      6     7
Chennai    8    9     10    11
Delhi     12   13     14    15

In [132]:
df3.drop(['Pune','Delhi'])

         one  two  three  four
Mumbai     0    1      2     3
Chennai    8    9     10    11

In [133]:
df3

         one  two  three  four
Mumbai     0    1      2     3
Pune       4    5      6     7
Chennai    8    9     10    11
Delhi     12   13     14    15

In [134]:
df3.drop('three',axis=1)

         one  two  four
Mumbai     0    1     3
Pune       4    5     7
Chennai    8    9    11
Delhi     12   13    15

In [135]:
df3

         one  two  three  four
Mumbai     0    1      2     3
Pune       4    5      6     7
Chennai    8    9     10    11
Delhi     12   13     14    15

In [136]:
df3.drop(['one','four'],axis=1)

         two  three
Mumbai     1      2
Pune       5      6
Chennai    9     10
Delhi     13     14

In [137]:
df3

         one  two  three  four
Mumbai     0    1      2     3
Pune       4    5      6     7
Chennai    8    9     10    11
Delhi     12   13     14    15

In [138]:
df4 = pd.DataFrame(np.arange(16).reshape(4,4),
                  index=['Mumbai','Pune','Chennai','Delhi'],
                  columns=['one','two','three','four'])

In [139]:
df4

         one  two  three  four
Mumbai     0    1      2     3
Pune       4    5      6     7
Chennai    8    9     10    11
Delhi     12   13     14    15

In [140]:
df4.drop(['one','four'],axis=1,inplace=True)

In [141]:
df4

         two  three
Mumbai     1      2
Pune       5      6
Chennai    9     10
Delhi     13     14

In [142]:
df5 = pd.DataFrame(np.arange(9).reshape(3,3),columns=['b','c','d'],index=['Mumbai','Pune','Nagpur'])

In [143]:
df5

        b  c  d
Mumbai  0  1  2
Pune    3  4  5
Nagpur  6  7  8

In [144]:
df6 = pd.DataFrame(np.arange(12).reshape(4,3),columns=['b','d','e'],index=['Delhi','Mumbai','Pune','Chennai'])

In [145]:
df6

         b   d   e
Delhi    0   1   2
Mumbai   3   4   5
Pune     6   7   8
Chennai  9  10  11

In [146]:
df5+df6

           b   c     d   e
Chennai  NaN NaN   NaN NaN
Delhi    NaN NaN   NaN NaN
Mumbai   3.0 NaN   6.0 NaN
Nagpur   NaN NaN   NaN NaN
Pune     9.0 NaN  12.0 NaN

In [147]:
df7 = df5.add(df6,fill_value=0)

In [148]:
df7

           b    c     d     e
Chennai  9.0  NaN  10.0  11.0
Delhi    0.0  NaN   1.0   2.0
Mumbai   3.0  1.0   6.0   5.0
Nagpur   6.0  7.0   8.0   NaN
Pune     9.0  4.0  12.0   8.0

In [149]:
df7.fillna(0)

           b    c     d     e
Chennai  9.0  0.0  10.0  11.0
Delhi    0.0  0.0   1.0   2.0
Mumbai   3.0  1.0   6.0   5.0
Nagpur   6.0  7.0   8.0   0.0
Pune     9.0  4.0  12.0   8.0

## functions & mapping

In [150]:
df8 = pd.DataFrame(np.random.randn(4,3),columns=['b','d','e'],index=['Mum','Chn','Del','Ngp'])

In [151]:
df8

            b         d         e
Mum  0.099658  0.512737  0.247418
Chn -0.282889 -0.289863  0.077795
Del -0.536943 -1.186904  1.843434
Ngp  0.000796 -0.358735  0.582020

In [152]:
df8['b'].min()

-0.5369425930406192

In [153]:
df8['b'].max()

0.09965752819864689

In [154]:
df8['b'].max() - df8['b'].min()

0.6366001212392661

In [155]:
difference = lambda x : x.max() - x.min()

In [156]:
df8.apply(difference,axis=0)   #0 --> col wise

b    0.636600
d    1.699642
e    1.765639
dtype: float64

In [157]:
df8.apply(difference,axis=1)   #1 --> row wise

Mum    0.413080
Chn    0.367659
Del    3.030339
Ngp    0.940755
dtype: float64

In [158]:
difference(df8['b'])

0.6366001212392661

In [159]:
df8['differnece'] = df8.apply(difference,axis=1)

In [160]:
df8

            b         d         e  differnece
Mum  0.099658  0.512737  0.247418    0.413080
Chn -0.282889 -0.289863  0.077795    0.367659
Del -0.536943 -1.186904  1.843434    3.030339
Ngp  0.000796 -0.358735  0.582020    0.940755

In [161]:
round_data = lambda x : "{:.2f}".format(x)

In [162]:
df8['differnece'].apply(round_data)

Mum    0.41
Chn    0.37
Del    3.03
Ngp    0.94
Name: differnece, dtype: object

In [163]:
name = pd.Series([
    'Benjamin Duran',
    'Benjamin Duran',
    'Benjamin Duran',
    'Benjamin Duran',
    'Benjamin Duran',
    'Benjamin Duran',
    'Safila Hatfield',
    'Safila Hatfield',
    'Safila Hatfield',
    'Safila Hatfield',
    'Safila Hatfield',
    'Safila Hatfield',
    'Toni Doyle',
    'Toni Doyle',
    'Toni Doyle',
    'Toni Doyle',
    'Toni Doyle',
    'Toni Doyle'
])



class_ = pd.Series([
    'A',
    'A',
    'A',
    'A',
    'A',
    'A',
    'B',
    'B',
    'B',
    'B',
    'B',
    'B',
    'C',
    'C',
    'C',
    'C',
    'C',
    'C'
])


Lectures = pd.Series([
    'Maths',
    'Chemistry',
    'Physics',
    'History',
    'Geography',
    'Science',
    'Maths',
    'Chemistry',
    'Physics',
    'History',
    'Geography',
    'Science',
    'Maths',
    'Chemistry',
    'Physics',
    'History',
    'Geography',
    'Science'
])

Grades = pd.Series([
    90,
    54,
    77,
    22,
    25,
    70,
    90,
    90,
    90,
    45,
    90,
    90,
    70,
    44,
    56,
    77,
    35,
    99
])


credits = pd.Series([
    6,6,6,5,5,4,6,6,6,5,5,4,6,6,6,5,5,4
])


retake = pd.Series([
    'No',
    'No',
    'No',
    'Yes',
    'Yes',
    'No',
    'No',
    'No',
    'No',
    'No',
    'No',
    'No',
    'No',
    'Yes',
    'No',
    'No',
    'Yes',
    'No'
])

In [164]:
data = pd.DataFrame({
    'name':name,
    'class':class_,
    'lectures':Lectures,
    'grades':Grades,
    'credits':credits,
    'retake':retake
})

In [165]:
data

               name class   lectures  grades  credits retake
0    Benjamin Duran     A      Maths      90        6     No
1    Benjamin Duran     A  Chemistry      54        6     No
2    Benjamin Duran     A    Physics      77        6     No
3    Benjamin Duran     A    History      22        5    Yes
4    Benjamin Duran     A  Geography      25        5    Yes
5    Benjamin Duran     A    Science      70        4     No
6   Safila Hatfield     B      Maths      90        6     No
7   Safila Hatfield     B  Chemistry      90        6     No
8   Safila Hatfield     B    Physics      90        6     No
9   Safila Hatfield     B    History      45        5     No
10  Safila Hatfield     B  Geography      90        5     No
11  Safila Hatfield     B    Science      90        4     No
12       Toni Doyle     C      Maths      70        6     No
13       Toni Doyle     C  Chemistry      44        6    Yes
14       Toni Doyle     C    Physics      56        6     No
15       Toni Doyle     C    History      77        5     No
16       Toni Doyle     C  Geography      35        5    Yes
17       Toni Doyle     C    Science      99        4     No

In [166]:
def classAllocation(marks):
    if marks >=75 and marks <=100:
        return "Distinction"
    
    elif marks >=60 and marks < 75:
        return "First Class"
    
    elif marks >=45 and marks < 60:
        return "Second Class"
    
    elif marks >=35 and marks < 45:
        return "Pass Class"
    
    else:
        return "Fail"

In [167]:
data['ClassType'] = data['grades'].apply(classAllocation)

In [168]:
data

               name class   lectures  grades  credits retake     ClassType
0    Benjamin Duran     A      Maths      90        6     No   Distinction
1    Benjamin Duran     A  Chemistry      54        6     No  Second Class
2    Benjamin Duran     A    Physics      77        6     No   Distinction
3    Benjamin Duran     A    History      22        5    Yes          Fail
4    Benjamin Duran     A  Geography      25        5    Yes          Fail
5    Benjamin Duran     A    Science      70        4     No   First Class
6   Safila Hatfield     B      Maths      90        6     No   Distinction
7   Safila Hatfield     B  Chemistry      90        6     No   Distinction
8   Safila Hatfield     B    Physics      90        6     No   Distinction
9   Safila Hatfield     B    History      45        5     No  Second Class
10  Safila Hatfield     B  Geography      90        5     No   Distinction
11  Safila Hatfield     B    Science      90        4     No   Distinction
12       Toni Doyle     C      Maths      70        6     No   First Class
13       Toni Doyle     C  Chemistry      44        6    Yes    Pass Class
14       Toni Doyle     C    Physics      56        6     No  Second Class
15       Toni Doyle     C    History      77        5     No   Distinction
16       Toni Doyle     C  Geography      35        5    Yes    Pass Class
17       Toni Doyle     C    Science      99        4     No   Distinction

In [169]:
def first_name(val):
    fname = val.split(' ')
    return fname[0]

In [170]:
data['FirstName'] = data['name'].apply(first_name)

In [171]:
data

,name,class,lectures,grades,credits,retake,ClassType,FirstName
0,Benjamin Duran,A,Maths,90,6,No,Distinction,Benjamin
1,Benjamin Duran,A,Chemistry,54,6,No,Second Class,Benjamin
2,Benjamin Duran,A,Physics,77,6,No,Distinction,Benjamin
3,Benjamin Duran,A,History,22,5,Yes,Fail,Benjamin
4,Benjamin Duran,A,Geography,25,5,Yes,Fail,Benjamin
5,Benjamin Duran,A,Science,70,4,No,First Class,Benjamin
6,Safila Hatfield,B,Maths,90,6,No,Distinction,Safila
7,Safila Hatfield,B,Chemistry,90,6,No,Distinction,Safila
8,Safila Hatfield,B,Physics,90,6,No,Distinction,Safila
9,Safila Hatfield,B,History,45,5,No,Second Class,Safila
10,Safila Hatfield,B,Geography,90,5,No,Distinction,Safila
11,Safila Hatfield,B,Science,90,4,No,Distinction,Safila
12,Toni Doyle,C,Maths,70,6,No,First Class,Toni
13,Toni Doyle,C,Chemistry,44,6,Yes,Pass Class,Toni
14,Toni Doyle,C,Physics,56,6,No,Second Class,Toni
15,Toni Doyle,C,History,77,5,No,Distinction,Toni
16,Toni Doyle,C,Geography,35,5,Yes,Pass Class,Toni
17,Toni Doyle,C,Science,99,4,No,Distinction,Toni

In [172]:
def last_name(val):
    lname = val.split(' ')
    return lname[1]

In [173]:
data['LastName'] = data['name'].apply(last_name)

In [174]:
data

,name,class,lectures,grades,credits,retake,ClassType,FirstName,LastName
0,Benjamin Duran,A,Maths,90,6,No,Distinction,Benjamin,Duran
1,Benjamin Duran,A,Chemistry,54,6,No,Second Class,Benjamin,Duran
2,Benjamin Duran,A,Physics,77,6,No,Distinction,Benjamin,Duran
3,Benjamin Duran,A,History,22,5,Yes,Fail,Benjamin,Duran
4,Benjamin Duran,A,Geography,25,5,Yes,Fail,Benjamin,Duran
5,Benjamin Duran,A,Science,70,4,No,First Class,Benjamin,Duran
6,Safila Hatfield,B,Maths,90,6,No,Distinction,Safila,Hatfield
7,Safila Hatfield,B,Chemistry,90,6,No,Distinction,Safila,Hatfield
8,Safila Hatfield,B,Physics,90,6,No,Distinction,Safila,Hatfield
9,Safila Hatfield,B,History,45,5,No,Second Class,Safila,Hatfield
10,Safila Hatfield,B,Geography,90,5,No,Distinction,Safila,Hatfield
11,Safila Hatfield,B,Science,90,4,No,Distinction,Safila,Hatfield
12,Toni Doyle,C,Maths,70,6,No,First Class,Toni,Doyle
13,Toni Doyle,C,Chemistry,44,6,Yes,Pass Class,Toni,Doyle
14,Toni Doyle,C,Physics,56,6,No,Second Class,Toni,Doyle
15,Toni Doyle,C,History,77,5,No,Distinction,Toni,Doyle
16,Toni Doyle,C,Geography,35,5,Yes,Pass Class,Toni,Doyle
17,Toni Doyle,C,Science,99,4,No,Distinction,Toni,Doyle

## Group By

In [210]:
data_1 = {
    'Company' : ['GOOGLE','GOOGLE','MICROSOFT','MICROSOFT','FB','FB'],
    'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
    'Sales':[200,120,340,124,243,350]
}

In [211]:
data_1

{'Company': ['GOOGLE', 'GOOGLE', 'MICROSOFT', 'MICROSOFT', 'FB', 'FB'],
 'Person': ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
 'Sales': [200, 120, 340, 124, 243, 350]}

In [212]:
df3 = pd.DataFrame(data_1)

In [213]:
df3

     Company   Person  Sales
0     GOOGLE      Sam    200
1     GOOGLE  Charlie    120
2  MICROSOFT      Amy    340
3  MICROSOFT  Vanessa    124
4         FB     Carl    243
5         FB    Sarah    350

In [179]:
grouped_data = df3.groupby('Company')

In [180]:
grouped_data

In [181]:
grouped_data.mean()

           Sales
Company
FB         296.5
GOOGLE     160.0
MICROSOFT  232.0

In [182]:
grouped_data.min()

            Person  Sales
Company
FB            Carl    243
GOOGLE     Charlie    120
MICROSOFT      Amy    124

In [183]:
grouped_data.max()

            Person  Sales
Company
FB           Sarah    350
GOOGLE         Sam    200
MICROSOFT  Vanessa    340

In [184]:
grouped_data.count()

           Person  Sales
Company
FB              2      2
GOOGLE          2      2
MICROSOFT       2      2

In [185]:
grouped_data.describe()

          Sales
          count   mean         std    min     25%    50%     75%    max
Company
FB          2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOGLE      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MICROSOFT   2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [187]:
df3

     Company   Person  Sales
0     GOOGLE      Sam    200
1     GOOGLE  Charlie    120
2  MICROSOFT      Amy    340
3  MICROSOFT  Vanessa    124
4         FB     Carl    243
5         FB    Sarah    350

In [206]:
fb_data = df3[df3['Company'] == 'FB']

In [207]:
google_data = df3[df3['Company'] == 'GOOGLE']

In [208]:
fb_data = fb_data.reset_index()

In [209]:
fb_data

   index Company Person  Sales
0      4      FB   Carl    243
1      5      FB  Sarah    350

In [201]:
google_data = google_data.reset_index()

In [203]:
fb_data['Sales'] - google_data['Sales']

0     43
1    230
Name: Sales, dtype: int64

In [214]:
ser1 = pd.Series(['c','a','d','a','a','b','b','c','c'])

In [215]:
ser1.unique()

array(['c', 'a', 'd', 'b'], dtype=object)

In [216]:
ser1.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

In [217]:
data

,name,class,lectures,grades,credits,retake,ClassType,FirstName,LastName
0,Benjamin Duran,A,Maths,90,6,No,Distinction,Benjamin,Duran
1,Benjamin Duran,A,Chemistry,54,6,No,Second Class,Benjamin,Duran
2,Benjamin Duran,A,Physics,77,6,No,Distinction,Benjamin,Duran
3,Benjamin Duran,A,History,22,5,Yes,Fail,Benjamin,Duran
4,Benjamin Duran,A,Geography,25,5,Yes,Fail,Benjamin,Duran
5,Benjamin Duran,A,Science,70,4,No,First Class,Benjamin,Duran
6,Safila Hatfield,B,Maths,90,6,No,Distinction,Safila,Hatfield
7,Safila Hatfield,B,Chemistry,90,6,No,Distinction,Safila,Hatfield
8,Safila Hatfield,B,Physics,90,6,No,Distinction,Safila,Hatfield
9,Safila Hatfield,B,History,45,5,No,Second Class,Safila,Hatfield
10,Safila Hatfield,B,Geography,90,5,No,Distinction,Safila,Hatfield
11,Safila Hatfield,B,Science,90,4,No,Distinction,Safila,Hatfield
12,Toni Doyle,C,Maths,70,6,No,First Class,Toni,Doyle
13,Toni Doyle,C,Chemistry,44,6,Yes,Pass Class,Toni,Doyle
14,Toni Doyle,C,Physics,56,6,No,Second Class,Toni,Doyle
15,Toni Doyle,C,History,77,5,No,Distinction,Toni,Doyle
16,Toni Doyle,C,Geography,35,5,Yes,Pass Class,Toni,Doyle
17,Toni Doyle,C,Science,99,4,No,Distinction,Toni,Doyle

In [218]:
data['FirstName'].value_counts()

Benjamin    6
Safila      6
Toni        6
Name: FirstName, dtype: int64

In [220]:
df3

     Company   Person  Sales
0     GOOGLE      Sam    200
1     GOOGLE  Charlie    120
2  MICROSOFT      Amy    340
3  MICROSOFT  Vanessa    124
4         FB     Carl    243
5         FB    Sarah    350

In [221]:
new_data = df3[((df3['Company'] == 'GOOGLE') | (df3['Company'] == 'FB'))]

In [222]:
new_data

  Company   Person  Sales
0  GOOGLE      Sam    200
1  GOOGLE  Charlie    120
4      FB     Carl    243
5      FB    Sarah    350

## Concatination

In [223]:
df4 = pd.DataFrame({
    'A' : ['A0','A1','A2','A3'],
    'B':['B0','B1','B2','B3'],
    'C':['C0','C1','C2','C3'],
    'D':['D0','D1','D2','D3']
},index=[0,1,2,3])

In [224]:
df4

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [225]:
df5 = pd.DataFrame({
    'A' : ['A4','A5','A6','A7'],
    'B':['B4','B5','B6','B7'],
    'C':['C4','C5','C6','C7'],
    'D':['D4','D5','D6','D7']
},index=[4,5,6,7])

In [226]:
df5

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [227]:
df6 = pd.DataFrame({
    'A' : ['A8','A9','A10','A11'],
    'B':['B8','B9','B10','B11'],
    'C':['C8','C9','C10','C11'],
    'D':['D8','D9','D10','D11']
},index=[8,9,10,11])

In [228]:
df6

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [229]:
pd.concat([df4,df5,df6])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [230]:
df8 = pd.DataFrame({
    'A' : ['A0','A1','A2','A3'],
    'B':['B0','B1','B2','B3'],
    'C':['C0','C1','C2','C3'],
    'D':['D0','D1','D2','D3']
},index=[0,1,2,3])


df9 = pd.DataFrame({
    'A' : ['A8','A9','A10','A11'],
    'B':['B8','B9','B10','B11'],
    'C':['C8','C9','C10','C11'],
    'D':['D8','D9','D10','D11']
},index=[0,1,2,3])

In [231]:
df8

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [232]:
df9

     A    B    C    D
0   A8   B8   C8   D8
1   A9   B9   C9   D9
2  A10  B10  C10  D10
3  A11  B11  C11  D11

In [233]:
pd.concat([df8,df9])

     A    B    C    D
0   A0   B0   C0   D0
1   A1   B1   C1   D1
2   A2   B2   C2   D2
3   A3   B3   C3   D3
0   A8   B8   C8   D8
1   A9   B9   C9   D9
2  A10  B10  C10  D10
3  A11  B11  C11  D11